#+PROPERTY: header-args:R  :session *R:cretaceous-constraints* :exports results :results output :eval no-export
#+options: TOC:nil
* COMMENT libs
#+begin_src R :exports code
  library(tidyverse)
  library(patchwork)
  theme_set(theme_bw())
#+end_src

#+RESULTS:
#+begin_example
── Attaching core tidyverse packages ───────────────────────────────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.2     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.0
✔ ggplot2   3.4.3     ✔ tibble    3.2.1
✔ lubridate 1.9.2     ✔ tidyr     1.3.0
✔ purrr     1.0.2
── Conflicts ─────────────────────────────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors
#+end_example

* COMMENT reproduce [cite:@Ma2017] steps
:PROPERTIES:
:CREATED:  [2023-08-28 Mon 10:52]
:END:
Load the R package Astrochron
This analysis uses version 0.6.6. Please use versions >= 0.6.6.

#+begin_src R
  library(astrochron)
#+end_src

#+RESULTS:
: Welcome to astrochron v1.2 (2023-08-25)
:  Type ?astrochron to learn more

* COMMENT read [cite:@ZeebeLourens2019,@ZeebeLourens2022] to reproduce their approach
:PROPERTIES:
:CREATED:  [2023-08-28 Mon 11:56]
:END:
:LOGBOOK:
CLOCK: [2023-08-28 Mon 17:02]--[2023-08-28 Mon 17:10] =>  0:08
CLOCK: [2023-08-28 Mon 14:55]--[2023-08-28 Mon 17:02] =>  2:07
- try to reproduce, cannot figureit out?
CLOCK: [2023-08-28 Mon 14:10]--[2023-08-28 Mon 14:55] =>  0:45
- do 2.4 Myr analysis on ZB18a
CLOCK: [2023-08-28 Mon 11:20]--[2023-08-28 Mon 12:08] =>  0:48
:END:

Richard's code
#+begin_src matlab
f  = 1./2000;
df = 0.6;

yf{i} = gaussfilter(t{i},y{i},f,df*f,2*df*f,0.0);

[~,ix{i}] = findpeaks(-yf{i});
kv = ix{i};
dt{i} = diff(t{i}(kv));
#+end_src


#+begin_src R
  library(tidyverse)

  # get orbital solution sol
  sol <- snvecR::get_ZB18a() |>
    select(age, ee)

  # Do the same as Zeebe and Lourens 2022:
  # filter 2 Myr ± 60% Gaussian
  # 2 Myr = 2000 kyr period = 1 / 2000 period
  x11(type = "cairo")
  bp2000 <- sol |>
    astrochron::bandpass(
                  padfac = 10, # 10x the number of data points
                  # parameterized as I understand Richard's matlab code
                  # this doesn't make any sense to me
                  ## flow = 0.6 * 1 / 2000,
                  ## fhigh = 2 * 0.6 * 1 / 2000,
                  flow = 1 / 2000 - 0.6 * 1 / 2000,
                  fhigh = 1 / 2000 + 0.6 * 1 / 2000,
                  win = 1, # Gaussian window
                  demean = TRUE, detrend = TRUE, #???
                  addmean = FALSE,
                  xmax = .02)
  grDevices::savePlot("imgs/2023-08-28_0_2Myr_bandpass_filter.png")

  # get the peak maxima
  pk2000 <- bp2000 |>
    astrochron::peak()
  grDevices::savePlot("imgs/2023-08-28_1_peak.png")

  # but in the paper they do peak minima, we just flip the input
  pk2000_flip <- bp2000 |>
    mutate(ee = -ee) |>
    astrochron::peak(genplot = TRUE)
  grDevices::savePlot("imgs/2023-08-28_2_peak.png")

  # calculate deltas between peaks
  pk2000_tidy <- pk2000 |>
    as_tibble() |>
    # different ways to calculate the delta
    mutate(delta_vln_lag = Location - lag(Location)) |> # this one minus previous one
    mutate(delta_vln = lead(Location) - Location) # next one minus this one
  pk2000_flip_tidy <- pk2000_flip |>
    as_tibble() |>
    mutate(delta_vln_lag = Location - lag(Location)) |>
    mutate(delta_vln = lead(Location) - Location)

  # check that peak id has gone well
  bp2000 |>
    ggplot(aes(x = age, y = ee)) +
    geom_line() +
    geom_point(aes(x = Location, y = Peak_Value, colour = "maxima"), data = pk2000_tidy) +
    geom_point(aes(x = Location, y = -Peak_Value, colour = "minima"), data = pk2000_flip_tidy)
  ggsave("~/SurfDrive/Postdoc1/prj/2023-05-19_cretaceous/imgs/2023-08-28_3_check_peaks.png")

  # create a plot similar to Zeebe and Lourens 2022 EPSL figure 6a
  pk2000_tidy |>
    ggplot(aes(x = Location / 1000, y = delta_vln / 1000)) +
    ## geom_point(aes(colour = "maxima lead")) +
    ## geom_line(aes(colour = "maxima lead")) +
    geom_point(aes(colour = "minima lead"), data = pk2000_flip_tidy) +
    geom_line(aes(colour = "minima lead"), data = pk2000_flip_tidy) +
    # did they use the half-distance? nope
    ## geom_point(aes(x = (Location + .5 * (lead(Location) - Location)) / 1000, colour = "minima lead"), data = pk2000_flip_tidy) +
    ## geom_line(aes(x = (Location + .5 * (lead(Location) - Location)) / 1000, colour = "minima lead"), data = pk2000_flip_tidy) +
    ## geom_point(aes(y = delta_vln_lag / 1000, colour = "maxima lag")) +
    ## geom_line(aes(y = delta_vln_lag / 1000, colour = "maxima lag")) +
    ## geom_point(aes(y = delta_vln_lag / 1000, colour = "minima lag"), data = pk2000_flip_tidy) +
    ## geom_line(aes(y = delta_vln_lag / 1000, colour = "minima lag"), data = pk2000_flip_tidy) +
    labs(x = "Age (Ma)",
         y = Delta[VLN] ~ "Interval between min/max in 2-Myr ecc filter (Myr)") +
    scale_x_continuous(breaks = seq(40, 80, 5)) +
    coord_cartesian(xlim = c(44, 70), ylim = c(0, 3))

  ggsave("imgs/2023-08-28_4_Dvln.png", width = 8, height = 3)
  ## ggsave("~/SurfDrive/Postdoc1/prj/2023-05-19_cretaceous/imgs/2023-08-28_4_Dvln.png")
#+end_src

#+RESULTS:
#+begin_example

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 250001
 ,* Sample interval= 0.4
 ,* Mean value removed= 0.02683078
 ,* Center of bandpass filter = 5e-04
 ,* 600 pos/neg frequency pairs will be bandpassed

----- FINDING MAXIMA OF PEAKS, FILTERING AT THRESHOLD VALUE -----
 ,* Number of data points= 250001
 ,* Number of columns= 2
 ,* Identifying maxima of peaks
 ,* Number of peaks identified= 50

 ,* No filtering of peaks applied.

----- FINDING MAXIMA OF PEAKS, FILTERING AT THRESHOLD VALUE -----
 ,* Number of data points= 250001
 ,* Number of columns= 2
 ,* Identifying maxima of peaks
 ,* Number of peaks identified= 51

 ,* No filtering of peaks applied.
Saving 7 x 6.99 in image
Warning messages:
1: Removed 1 rows containing missing values (`geom_point()`).
2: Removed 1 row containing missing values (`geom_line()`).
Warning messages:
1: Removed 1 rows containing missing values (`geom_point()`).
2: Removed 1 row containing missing values (`geom_line()`).
#+end_example

**** read in the data and calculate normalized a*/b*
#+begin_src R
  ODP208_1267_color_A <- readr::read_tsv("dat/ODP208_1267_color-reflectance.dat")
  ODP208_1267_color_B <- readr::read_tsv("dat/ODP208_1267_color-reflectance_B.dat")

  dat <- ODP208_1267_color_B |>
    select(depth = `Depth (mbsf)`,
           Lstar = `L*`,
           astar = `a*`,
           bstar = `b*`) |>
    filter(depth >= 285.9) |>
    mutate(aob = scale(astar / bstar)[, 1]) |>
    select(depth, astar, everything())

  # raw data with simple loess curve
  dat |>
    ggplot(aes(x = depth, y = Lstar)) +
    geom_line() +
    geom_line(aes(x = `Depth (mbsf)`, y = `L*`), data = ODP208_1267_color_A, alpha = .2) +
    geom_smooth(method = "loess", span = .2) +
    geom_smooth(method = "gam", color = "orange")

  # let's see how sensitive it is to the span or to size of the rolling mean

  fit_loess <- loess(Lstar ~ depth, data = dat, span = .75)
  fit_gam <- mgcv::gam(Lstar ~ depth, data = dat)

  lp <- dat |>
    select(depth, Lstar_scl) |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::lowpass(fcut = 1 / 15) # how do you decide which frequency to cull?
  # this is linearly interpolated so it can't go into the other df

  dat <- dat |>
    mutate(
      # there are several methods of calculating a rolling average
      ## ma = roll::roll_mean() # that's left-aligned
      ## ma = zoo::rollmean(Lstar, k = 33, align = "center", na.pad = TRUE),
      # I prefer the slider implementation, it's FAAAST
      # I've played around with the size of the window. If I make it larger,
      # more low-frequency peaks are preserved.
      ma = slider::slide_mean(Lstar, before = 3, after = 3),
      loess = predict(fit_loess),
      gam = predict(fit_gam),
      Lstar_scl = scale(Lstar),
      Lstar_loess_scl = scale(Lstar - loess),
      Lstar_gam_scl = scale(Lstar - loess),
      Lstar_ma_scl = scale(Lstar - ma))

  dat |>
    ggplot(aes(x = depth, y = Lstar)) +
    geom_line(alpha = .3) +
    geom_line(aes(y = loess), colour = "orange") +
    geom_line(aes(y = gam), colour = "red") +
    geom_line(aes(y = ma), colour = "indianred")

  dat |>
    ggplot(aes(x = depth, y = Lstar_scl)) +
    geom_line() +
    geom_line(aes(y = Lstar_loess_scl + 3), colour = "orange") +
    geom_line(aes(y = Lstar_gam_scl + 6), colour = "red") +
    geom_line(aes(y = Lstar_ma_scl + 9), colour = "indianred")

  dat |>
    drop_na() |>
    select(depth,
           Lstar,
           ## Lstar_loess_scl
           ## Lstar_gam_scl
           ## Lstar_ma_scl
           ) |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::mtm(output = 1) |>
    as_tibble()

  # I like gam I think?

  filt_bp <- dat |>
    drop_na() |>
    select(depth, Lstar_gam_scl) |>
    astrochron::linterp(genplot = FALSE) |>
    ## astrochron::bandpass(flow = 0, fhigh = .3, win = 0, xmax = 1) |> # uniform window
    astrochron::bandpass(flow = 2., fhigh = 3., win = 1, xmax = 10) |> # gaussian window
    ## astrochron::taner(flow = 0, fhigh = .3, xmax = 1) |> # taner window
    as_tibble()

  filt_bp |>
    astrochron::hilbert(genplot = FALSE) |>
    astrochron::peak() |>
    as_tibble()

  dat |>
    ggplot(aes(x = depth, y = Lstar_gam_scl)) +
    geom_line(alpha = .3) +
    geom_line(data = filt_bp)
#+end_src

#+RESULTS:
: indexed 0B in  0s, 0B/sindexed 1.00TB in  0s, 44.17TB/s                                                                                                       Rows: 25316 Columns: 15
: ── Column specification ─────────────────────────────────────────────────────────────────────────────────
: Delimiter: "\t"
: chr  (4): H, T, Sec, Munsell_HVC
: dbl (11): Leg, Site, Core, Top (cm), Depth (mbsf), L*, a*, b*, X, Y, Z
:
: ℹ Use `spec()` to retrieve the full column specification for this data.
: ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

**** get the maxima of the 405 kyr filter
:PROPERTIES:
:CREATED:  [2023-09-19 Tue 12:17]
:END:
#+begin_src R
  pk405 <- f405 |>
    astrochron::peak() |>
    as_tibble() |>
    mutate(
      n_cyc = 0:n(),
      age_405 = 65940 + n_cyc * 405) # ZB18a eq 2 or 66.96 for eq 3

  pk405 |>
    ggplot(aes(x = Location, y = age_405)) +
    geom_line() + geom_point()

  dat <- dat |>
    mutate(
      age = astrochron::tune(dat,
                   controlPts = pk405 |>
                     select(depth = Location, age_405),
                   extrapolate = TRUE,
                   genplot = FALSE)$X1)

  dat |>
    ggplot(aes(x = age, y = aob)) +
    geom_line()

  dat |>
    select(age, aob) |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::mtm(xmax = .06)
#+end_src

#+RESULTS:
#+begin_example
----- FINDING MAXIMA OF PEAKS, FILTERING AT THRESHOLD VALUE -----
 ,* Number of data points= 1733
 ,* Number of columns= 2
 ,* Identifying maxima of peaks
 ,* Number of peaks identified= 10

 ,* No filtering of peaks applied.
Error in `mutate()`:
ℹ In argument: `n_cyc = 0:n()`.
Caused by error:
! `n_cyc` must be size 10 or 1, not 11.
Run `rlang::last_trace()` to see where the error occurred.
+ + ----- TUNING STRATIGRAPHIC SERIES -----
 ,* Number of data points= 2794
 ,* Number of time control points= 10
 ,* Sorting datasets into ensure increasing order, removing empty entries

,**** WARNING: duplicate depth/height datum found in dat

 ,* Mean sampling interval= 1.332388
 ,* Median sampling interval= 1.808036
 ,* Maximum sampling interval= 7.714286
 ,* Minimum sampling interval= 0

----- PERFORMING Multitaper Spectral Analysis -----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 2794
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 1.808036
 ,* New number of samples= 2059
 ,* Number of data points in stratigraphic series: 2059
 ,* Stratigraphic series length (space or time): 3720.937
 ,* Sampling interval (space or time): 1.808036
 ,* Will use default setting of 5 DPSS tapers
 ,* Mean value subtracted= 0.1015833
 ,* Linear trend NOT subtracted
 ,* Nyquist frequency: 0.2765432
 ,* Rayleigh frequency: 0.000268619
 ,* MTM Power spectrum bandwidth resolution (halfwidth): 0.0008058569
 ,* Padded to 10296 points

 ,* Searching for significant spectral peaks that satisfy 90 % CL
     requirements outlined in Meyers (2012):
 ,* Number of significant F-test peaks identified = 32
ID  / Frequency / Period / Harmonic_CL / Rednoise_CL
1   0.0006983414   1431.964   94.44193   100
2   0.05661938   17.6618   93.88804   72.1348
3   0.07939605   12.59509   96.82607   99.47927
4   0.08933399   11.19395   91.71181   99.89702
5   0.09696202   10.31332   96.70337   87.05542
6   0.1005612   9.944196   99.55621   73.2013
7   0.1086727   9.201945   97.34754   98.66957
8   0.1129164   8.856106   97.60775   85.1843
9   0.114528   8.73149   94.97761   84.96299
10   0.1195775   8.362774   99.83013   88.32753
11   0.122156   8.186251   99.41092   98.80402
12   0.1250568   7.996364   94.28173   88.18916
13   0.127689   7.831525   94.57301   81.88665
14   0.1369824   7.30021   97.90853   98.13951
15   0.1387551   7.206944   97.25249   92.8674
16   0.1409575   7.094335   96.86739   94.83192
17   0.1489079   6.715561   92.28015   95.59369
18   0.1514864   6.601254   94.20763   93.80038
19   0.159383   6.274195   97.75216   99.2873
20   0.1655606   6.040083   92.94299   87.10266
21   0.1705565   5.863161   95.31809   73.97557
22   0.173135   5.775841   96.94309   84.24478
23   0.1749614   5.715547   92.92138   56.35226
24   0.1773787   5.637655   99.02583   98.2947
25   0.1781308   5.613853   97.85763   98.6933
26   0.1792052   5.580197   98.92372   86.87813
27   0.182482   5.479993   98.91651   79.7809
28   0.1835564   5.447918   97.99307   63.96113
29   0.1890357   5.290007   99.94708   66.57191
30   0.1905398   5.248248   98.70234   89.36756
31   0.2014984   4.962819   91.57414   75.61101
32   0.2053661   4.869353   93.86716   93.96291
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
#+end_example

